<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Intro to Data Representation and Data Cleaning


---

<img src="https://snag.gy/ywU34V.jpg" width="250">

## Learning Objectives


### Core
- Know about common data cleaning strategies
- Know how to assess data quality
- Inspect data types
- Fill missing values with `fillna`
- Count categorical values with `.value_counts`

### Target
- Know the difference between `.map`, `.apply`, `.applymap`  
- Clean up a column using `.map`, `.apply`, `.applymap`  

### Stretch
- Write your own function and apply it to a series/dataframe with `.map`, `.apply`, `.applymap`

<h1>Lesson Guide<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Learning-Objectives" data-toc-modified-id="Learning-Objectives-1">Learning Objectives</a></span><ul class="toc-item"><li><span><a href="#Core" data-toc-modified-id="Core-1.1">Core</a></span></li><li><span><a href="#Target" data-toc-modified-id="Target-1.2">Target</a></span></li><li><span><a href="#Stretch" data-toc-modified-id="Stretch-1.3">Stretch</a></span></li></ul></li><li><span><a href="#Common-Data-Cleaning-Strategies" data-toc-modified-id="Common-Data-Cleaning-Strategies-2">Common Data Cleaning Strategies</a></span></li><li><span><a href="#Measures-of-Data-Quality" data-toc-modified-id="Measures-of-Data-Quality-3">Measures of Data Quality</a></span></li><li><span><a href="#pandas-Tools-for-Data-Cleaning" data-toc-modified-id="pandas-Tools-for-Data-Cleaning-4"><code>pandas</code> Tools for Data Cleaning</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#The-.map()-function" data-toc-modified-id="The-.map()-function-4.0.1">The <code>.map()</code> function</a></span></li><li><span><a href="#The-.apply()-function" data-toc-modified-id="The-.apply()-function-4.0.2">The <code>.apply()</code> function</a></span></li><li><span><a href="#The-.applymap()-function" data-toc-modified-id="The-.applymap()-function-4.0.3">The <code>.applymap()</code> function</a></span></li><li><span><a href="#The-.fillna()-function" data-toc-modified-id="The-.fillna()-function-4.0.4">The <code>.fillna()</code> function</a></span></li><li><span><a href="#The-.value_counts()-function" data-toc-modified-id="The-.value_counts()-function-4.0.5">The <code>.value_counts()</code> function</a></span></li></ul></li></ul></li><li><span><a href="#Inspecting-Data-Types" data-toc-modified-id="Inspecting-Data-Types-5">Inspecting Data Types</a></span><ul class="toc-item"><li><span><a href="#1.-Create-a-small-DataFrame-with-different-data-types" data-toc-modified-id="1.-Create-a-small-DataFrame-with-different-data-types-5.1">1. Create a small DataFrame with different data types</a></span></li><li><span><a href="#2.-Examine-the-data-types-of-the-columns" data-toc-modified-id="2.-Examine-the-data-types-of-the-columns-5.2">2. Examine the data types of the columns</a></span></li><li><span><a href="#3.-Use-the-.get_dtype_counts()-function-to-determine-how-many-columns-there-are-of-each-type" data-toc-modified-id="3.-Use-the-.get_dtype_counts()-function-to-determine-how-many-columns-there-are-of-each-type-5.3">3. Use the <code>.get_dtype_counts()</code> function to determine how many columns there are of each type</a></span></li><li><span><a href="#4.-Create-a-Series-object-with-integers-1-5-and-float-6.0." data-toc-modified-id="4.-Create-a-Series-object-with-integers-1-5-and-float-6.0.-5.4">4. Create a Series object with integers 1-5 and float 6.0.</a></span></li><li><span><a href="#5.-Create-a-Series-with-data-[1,-2,-3,-6.,-'foo'].-What-data-type-is-the-Series?" data-toc-modified-id="5.-Create-a-Series-with-data-[1,-2,-3,-6.,-'foo'].-What-data-type-is-the-Series?-5.5">5. Create a Series with data <code>[1, 2, 3, 6., 'foo']</code>. What data type is the Series?</a></span></li><li><span><a href="#Without-running-this-code-with-a-Python-interpreter,-what-would-you-expect-to-be-the-common-dtype?" data-toc-modified-id="Without-running-this-code-with-a-Python-interpreter,-what-would-you-expect-to-be-the-common-dtype?-5.6"><em>Without</em> running this code with a Python interpreter, what would you expect to be the common <code>dtype</code>?</a></span></li></ul></li><li><span><a href="#Applying-Functions-to-DataFrames-and-Series" data-toc-modified-id="Applying-Functions-to-DataFrames-and-Series-6">Applying Functions to DataFrames and Series</a></span><ul class="toc-item"><li><span><a href="#6.-Create-another-small-DataFrame" data-toc-modified-id="6.-Create-another-small-DataFrame-6.1">6. Create another small DataFrame</a></span></li><li><span><a href="#7.-Use-the-.apply()/.applymap()-function-to-find-the-square-root-of-all-cells" data-toc-modified-id="7.-Use-the-.apply()/.applymap()-function-to-find-the-square-root-of-all-cells-6.2">7. Use the <code>.apply()</code>/<code>.applymap()</code> function to find the square root of all cells</a></span></li><li><span><a href="#8.-Use-.apply()-to-find-the-mean-of-the-columns" data-toc-modified-id="8.-Use-.apply()-to-find-the-mean-of-the-columns-6.3">8. Use <code>.apply()</code> to find the mean of the columns</a></span></li><li><span><a href="#9.-Use-.apply()-to-find-the-mean-of-the-rows" data-toc-modified-id="9.-Use-.apply()-to-find-the-mean-of-the-rows-6.4">9. Use <code>.apply()</code> to find the mean of the rows</a></span></li><li><span><a href="#10.-Use-.apply()-to-add-two-columns" data-toc-modified-id="10.-Use-.apply()-to-add-two-columns-6.5">10. Use <code>.apply()</code> to add two columns</a></span></li><li><span><a href="#11.-Use-.applymap()-to-round-the-value-in-each-cell" data-toc-modified-id="11.-Use-.applymap()-to-round-the-value-in-each-cell-6.6">11. Use <code>.applymap()</code> to round the value in each cell</a></span></li><li><span><a href="#12.-Use-.applymap()-to-apply-a-self-defined-function-to-each-cell" data-toc-modified-id="12.-Use-.applymap()-to-apply-a-self-defined-function-to-each-cell-6.7">12. Use <code>.applymap()</code> to apply a self-defined function to each cell</a></span></li></ul></li><li><span><a href="#Filling-missing-values" data-toc-modified-id="Filling-missing-values-7">Filling missing values</a></span><ul class="toc-item"><li><span><a href="#13.-Fill-all-missing-values-with-'neg'-(indicating-that-the-missing-value-was-due-to-a-negative-original-value)" data-toc-modified-id="13.-Fill-all-missing-values-with-'neg'-(indicating-that-the-missing-value-was-due-to-a-negative-original-value)-7.1">13. Fill all missing values with 'neg' (indicating that the missing value was due to a negative original value)</a></span></li><li><span><a href="#14.-We-could-do-that-also-for-one-column-only." data-toc-modified-id="14.-We-could-do-that-also-for-one-column-only.-7.2">14. We could do that also for one column only.</a></span></li><li><span><a href="#15.-In-other-contexts,-it-might-be-useful-to-fill-with-other-values." data-toc-modified-id="15.-In-other-contexts,-it-might-be-useful-to-fill-with-other-values.-7.3">15. In other contexts, it might be useful to fill with other values.</a></span></li><li><span><a href="#16.-Forward-filling-propagates-values-from-rows-above" data-toc-modified-id="16.-Forward-filling-propagates-values-from-rows-above-7.4">16. Forward filling propagates values from rows above</a></span></li><li><span><a href="#17.-Backward-filling-propagates-values-from-rows-below" data-toc-modified-id="17.-Backward-filling-propagates-values-from-rows-below-7.5">17. Backward filling propagates values from rows below</a></span></li></ul></li><li><span><a href="#Counting-Occurrances-of-Unique-Values-With-.value_counts()" data-toc-modified-id="Counting-Occurrances-of-Unique-Values-With-.value_counts()-8">Counting Occurrances of Unique Values With <code>.value_counts()</code></a></span><ul class="toc-item"><li><span><a href="#18.-Create-a-random-vector-of-50-numbers-ranging-from-0-to-6-with-numpy" data-toc-modified-id="18.-Create-a-random-vector-of-50-numbers-ranging-from-0-to-6-with-numpy-8.1">18. Create a random vector of 50 numbers ranging from 0 to 6 with <code>numpy</code></a></span></li><li><span><a href="#19.-Convert-the-vector-to-a-series-and-count-the-occurrences-of-each-number" data-toc-modified-id="19.-Convert-the-vector-to-a-series-and-count-the-occurrences-of-each-number-8.2">19. Convert the vector to a series and count the occurrences of each number</a></span></li></ul></li><li><span><a href="#Independent-Practice:-Sales-Data" data-toc-modified-id="Independent-Practice:-Sales-Data-9">Independent Practice: Sales Data</a></span></li><li><span><a href="#Conclusion" data-toc-modified-id="Conclusion-10">Conclusion</a></span></li><li><span><a href="#Additional-resources" data-toc-modified-id="Additional-resources-11">Additional resources</a></span></li></ul></div>

## Common Data Cleaning Strategies

---

- Remove missing values
- Remove incorrect values
- Update incorrect values
  - Removing invalid characters
  - Truncating part of a value
  - Adding an extra numeral or string-based data
- Impute missing or invalid data
  - Calculating the mean/median/mode of a column, sometimes within group subsets
  - Implementing model-based imputation (K-Nearest Neighbors, MICE, etc.)
- Backward fill or forward fill

## Measures of Data Quality

---

 - What is the relative value of the data column?
 - Is the data encoded properly?
 - Is the data consistently encoded? 
 - Does it represent the information it contains appropriately?

##  `pandas` Tools for Data Cleaning

---

We're starting to get more comfortable with using `pandas` for manipulating and examining data. Now, let's add a couple more tools to our toolbox.

The main data types in `pandas` objects are:
- **`float`**: Precision-specific math operations
- **`int`**: Operations with whole numbers
- **`bool`**: Control flow conditions
- **`datetime64`**: Resampling, slicing/selection, frequency back/front filling on a date range
- **`timedelta`**: Date comparisons
- **`category`**: A more powerful set type; can capture for example days as a category with ordinal (ordering) information
- **`object`**: All data types can be represented as an object, but math and date operations will not be possible; limited control flow possibilities are available unless you are comparing strings

It is always important to evaluate the data types of columns to ensure that the information they contain is properly represented.

We will be using two tools extensively in this lesson:

#### The `.map()` function

This built-in function can be used to apply a function to a pandas series or single dataframe colum.

#### The `.apply()` function

This function can be used to apply a function along every row or column of a dataframe, what is returned depends on if the function aggregates or not.

#### The `.applymap()` function

This function can be used to apply a function to every cell of a dataframe.

#### The `.fillna()` function

This built-in function allows to specify methods for filling missing data.

#### The `.value_counts()` function

The `.value_counts()` function can be applied to `pandas` series objects and returns a new series containing the counts of the data's unique values. This series will be formatted in descending order by default, so the first element is the most frequently occurring value.

Note: `.value_counts()` excludes the counts of null values in the column!

## Inspecting Data Types

---

In [1]:
import pandas as pd
import numpy as np

### 1. Create a small DataFrame with different data types

In [2]:
test_data = dict(
    A=np.random.rand(3),
    B=1,
    C='foo',
    D=pd.Timestamp('20010102'),
    E=pd.Series([1.0]*3).astype('float32'),
    F=False,
    G=pd.Series([1]*3, dtype='int8')
)

In [3]:
test_data

{'A': array([0.7135332 , 0.82147843, 0.92805249]),
 'B': 1,
 'C': 'foo',
 'D': Timestamp('2001-01-02 00:00:00'),
 'E': 0    1.0
 1    1.0
 2    1.0
 dtype: float32,
 'F': False,
 'G': 0    1
 1    1
 2    1
 dtype: int8}

In [4]:
df_test = pd.DataFrame(test_data)
df_test

          A  B    C          D    E      F  G
0  0.713533  1  foo 2001-01-02  1.0  False  1
1  0.821478  1  foo 2001-01-02  1.0  False  1
2  0.928052  1  foo 2001-01-02  1.0  False  1

In [5]:
# Create a dataframe from the dictionary

### 2. Examine the data types of the columns

In [6]:
df_test.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

### 3. Use the `.get_dtype_counts()` function to determine how many columns there are of each type

In [7]:
df_test.get_dtype_counts()

float64           1
float32           1
int64             1
int8              1
datetime64[ns]    1
bool              1
object            1
dtype: int64

### 4. Create a Series object with integers 1-5 and float 6.0. 

- What data type is the Series?
- What if instead of a float you inserted a string `'6'`?
- Can you convert the series to int format?

In [8]:
pd.Series([1,2,3,4,5,"6.0"])   # notice that Series, S is capitalized

0      1
1      2
2      3
3      4
4      5
5    6.0
dtype: object

In [88]:
type(pd.Series([1,2,3,4,5,"6.0"])[5] )  


#how you convert a series in to different format change [0],

str

### 5. Create a Series with data `[1, 2, 3, 6., 'foo']`. What data type is the Series?

In [10]:
pd.Series([1,2,3,4,"foo"])

0      1
1      2
2      3
3      4
4    foo
dtype: object

### *Without* running this code with a Python interpreter, what would you expect to be the common `dtype`?

    [1, 3, 9, .33, False, '03-20-1978', np.arange(22)]

In [11]:
pd.Series([1, 3, 9, .33, False, '03-20-1978', np.arange(22)])

0                                                    1
1                                                    3
2                                                    9
3                                                 0.33
4                                                False
5                                           03-20-1978
6    [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,...
dtype: object

## Applying Functions to DataFrames and Series

* `df.map()` can be used to apply a function to a pandas series or single dataframe colum.
* `df.apply()` can be used to apply a function along every row or column of a dataframe, what is returned depends on if the function aggregates or not.
* `df.applymap()` can be used to apply a function to every cell of a dataframe.

### 6. Create another small DataFrame

In [12]:
xxx=np.random.seed(1)
print(xxx)

None

In [13]:
# Create some more test data.
np.random.seed(1) # create a matrics of random numbers
df = pd.DataFrame(np.random.randn(5, 4), columns=['a', 'b', 'c', 'd'])  #create a table with that random numbers
df

          a         b         c         d
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815

### 7. Use the `.apply()`/`.applymap()` function to find the square root of all cells

In [14]:
df.applymap(np.sqrt) # sqrt=square root

/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6551: RuntimeWarning: invalid value encountered in sqrt
  return lib.map_infer(x.astype(object).values, func)

          a   b         c         d
0  1.274498 NaN       NaN       NaN
1  0.930273 NaN  1.320913       NaN
2  0.564835 NaN  1.209177       NaN
3       NaN NaN  1.064786       NaN
4       NaN NaN  0.205460  0.763423

In [15]:
np.sqrt([1,2,3,4])

array([1.        , 1.41421356, 1.73205081, 2.        ])

In [16]:
# Square root ALL CELLS (NaN == Not a Number).
df_sqrt = df.apply(np.sqrt)
df_sqrt

          a   b         c         d
0  1.274498 NaN       NaN       NaN
1  0.930273 NaN  1.320913       NaN
2  0.564835 NaN  1.209177       NaN
3       NaN NaN  1.064786       NaN
4       NaN NaN  0.205460  0.763423

### 8. Use `.apply()` to find the mean of the columns

In [17]:
df_sqrt.mean()  #take mean of each column

a    0.923202
b         NaN
c    0.950084
d    0.763423
dtype: float64

In [18]:
df_sqrt.apply(np.mean)

a    0.923202
b         NaN
c    0.950084
d    0.763423
dtype: float64

### 9. Use `.apply()` to find the mean of the rows

In [19]:
df_sqrt.apply(np.mean, axis = 1)

0    1.274498
1    1.125593
2    0.887006
3    1.064786
4    0.484442
dtype: float64

### 10. Use `.apply()` to add two columns

In [20]:
df_sqrt['a']+df_sqrt['c']

0         NaN
1    2.251186
2    1.774012
3         NaN
4         NaN
dtype: float64

In [52]:
def my_addition(x, first=0, second=2):
    return x[first]+x[second]      #

In [22]:
df_sqrt.apply(my_addition, axis=1, first=0, second=2)  #notice how "my_addition" function is called here.
#it's different to call a normal function. bucause it's working on a series, a table.

0         NaN
1    2.251186
2    1.774012
3         NaN
4         NaN
dtype: float64

### 11. Use `.applymap()` to round the value in each cell

In [23]:
def my_rounding(x, ndigits=2):   # round to 2 digits
    return round(x, ndigits=ndigits)   #round all values

In [24]:
my_rounding(3.1415)

3.14

In [25]:
df_sqrt.applymap(my_rounding)

      a   b     c     d
0  1.27 NaN   NaN   NaN
1  0.93 NaN  1.32   NaN
2  0.56 NaN  1.21   NaN
3   NaN NaN  1.06   NaN
4   NaN NaN  0.21  0.76

In [26]:
df_sqrt.applymap(lambda x: round(x, ndigits=2))

      a   b     c     d
0  1.27 NaN   NaN   NaN
1  0.93 NaN  1.32   NaN
2  0.56 NaN  1.21   NaN
3   NaN NaN  1.06   NaN
4   NaN NaN  0.21  0.76

In [27]:
df_sqrt.applymap(lambda x: round(x, ndigits=3))

       a   b      c      d
0  1.274 NaN    NaN    NaN
1  0.930 NaN  1.321    NaN
2  0.565 NaN  1.209    NaN
3    NaN NaN  1.065    NaN
4    NaN NaN  0.205  0.763

### 12. Use `.applymap()` to apply a self-defined function to each cell

In [28]:
def adder(x,add_num=2):
    return x+add_num

In [29]:
df_sqrt.apply(adder, add_num=5)

          a   b         c         d
0  6.274498 NaN       NaN       NaN
1  5.930273 NaN  6.320913       NaN
2  5.564835 NaN  6.209177       NaN
3       NaN NaN  6.064786       NaN
4       NaN NaN  5.205460  5.763423

In [30]:
df_sqrt.applymap(lambda x: x**2)

          a   b         c         d
0  1.624345 NaN       NaN       NaN
1  0.865408 NaN  1.744812       NaN
2  0.319039 NaN  1.462108       NaN
3       NaN NaN  1.133769       NaN
4       NaN NaN  0.042214  0.582815

## Filling missing values

---

When we took the square root of all the elements in df, some values where not mapped to another number because they were negative. One could use `.applymap()` in some way to fill these values. A more direct method uses pandas' data filling methods.

### 13. Fill all missing values with 'neg' (indicating that the missing value was due to a negative original value)

In [43]:
df_sqrt

          a    b         c         d
0  1.274498  neg  0.950084  0.763423
1  0.930273  neg  1.320913  0.763423
2  0.564835  neg  1.209177  0.763423
3  0.564835  neg  1.064786  0.763423
4  0.564835  neg  0.205460  0.763423

In [44]:
df_sqrt.fillna('neg')

          a    b         c         d
0  1.274498  neg  0.950084  0.763423
1  0.930273  neg  1.320913  0.763423
2  0.564835  neg  1.209177  0.763423
3  0.564835  neg  1.064786  0.763423
4  0.564835  neg  0.205460  0.763423

In [33]:
df_sqrt

          a   b         c         d
0  1.274498 NaN       NaN       NaN
1  0.930273 NaN  1.320913       NaN
2  0.564835 NaN  1.209177       NaN
3       NaN NaN  1.064786       NaN
4       NaN NaN  0.205460  0.763423

### 14. We could do that also for one column only. 

Note that the given dataframe was not modified before. We have to specify `inplace=True` to do so.

In [34]:
df_sqrt.fillna({'b': 'neg'}, inplace=True)
df_sqrt

          a    b         c         d
0  1.274498  neg       NaN       NaN
1  0.930273  neg  1.320913       NaN
2  0.564835  neg  1.209177       NaN
3       NaN  neg  1.064786       NaN
4       NaN  neg  0.205460  0.763423

In [46]:
df_sqrt.b.replace({"neg","O"})

0    neg
1    neg
2    neg
3    neg
4    neg
Name: b, dtype: object

### 15. In other contexts, it might be useful to fill with other values. 

Just to show how it works,
let's fill the missing value in column `c`with the column mean.

In [35]:
df_sqrt.c.fillna(df_sqrt.c.mean(), inplace=True)  #take the mean of col c and give it to NaN in c col
df_sqrt

          a    b         c         d
0  1.274498  neg  0.950084       NaN
1  0.930273  neg  1.320913       NaN
2  0.564835  neg  1.209177       NaN
3       NaN  neg  1.064786       NaN
4       NaN  neg  0.205460  0.763423

### 16. Forward filling propagates values from rows above

In [36]:
df_sqrt.a.fillna(method='ffill', inplace=True)
df_sqrt

          a    b         c         d
0  1.274498  neg  0.950084       NaN
1  0.930273  neg  1.320913       NaN
2  0.564835  neg  1.209177       NaN
3  0.564835  neg  1.064786       NaN
4  0.564835  neg  0.205460  0.763423

In [37]:
df_sqrt.d.fillna(method='ffill', inplace=False)

0         NaN
1         NaN
2         NaN
3         NaN
4    0.763423
Name: d, dtype: float64

### 17. Backward filling propagates values from rows below

In [38]:
df_sqrt.d.fillna(method='bfill', inplace=True)
df_sqrt

          a    b         c         d
0  1.274498  neg  0.950084  0.763423
1  0.930273  neg  1.320913  0.763423
2  0.564835  neg  1.209177  0.763423
3  0.564835  neg  1.064786  0.763423
4  0.564835  neg  0.205460  0.763423

## Counting Occurrances of Unique Values With `.value_counts()`

---

The pandas function `.value_counts()` tells us the count of unique values in a column's data. It's helpful for identifying unexpected values and the data distribution, especially when looking at group membership.  Looking at the value counts per column can give us a quick overview of values expressed in our data.

Some common use cases of `.value_counts()` include:
 - Finding strings inside mostly numeric/continuous data
 - Finding non-numeric values
 - Checking the distribution of categorical variables
 - Identifying the most and least common values

### 18. Create a random vector of 50 numbers ranging from 0 to 6 with `numpy`

In [39]:
np.random.seed(1)
data = np.random.randint(0, 7, size=50)
data

array([5, 3, 4, 0, 1, 3, 5, 0, 0, 1, 4, 5, 4, 6, 1, 2, 4, 6, 5, 2, 4, 3,
       4, 2, 4, 5, 6, 2, 4, 1, 1, 6, 0, 6, 5, 1, 1, 5, 6, 1, 1, 0, 4, 1,
       0, 0, 5, 3, 2, 1])

### 19. Convert the vector to a series and count the occurrences of each number

In [40]:
s = pd.Series(data)
s.head()

0    5
1    3
2    4
3    0
4    1
dtype: int64

In [41]:
# The counts for each number in our array
s.value_counts()

1    11
4     9
5     8
0     7
6     6
2     5
3     4
dtype: int64

## Independent Practice: Sales Data

---

1. Load the `sales.csv` data set from last week's class.
- Inspect the data types.
- Imagine you've found out that all your values in column 1 are off by one. Use `.apply()` or `.map()` to add `1` to column 1 of the data set.
- Use `.apply` to add $2\cdot {\rm column}_1 + 3\cdot {\rm column}_3$
- Use a combination of `apply` and `.value_counts()` to count how many values of `2015_margin` are larger than 45.

In [42]:
df = pd.read_csv('../../../../resource-datasets/sales_data_simple/sales.csv')
df.head()

   volume_sold  2015_margin  2015_q1_sales  2016_q1_sales
0    18.420760    93.802281      337166.53      337804.05
1     4.776510    21.082425       22351.86       21736.63
2    16.602401    93.612494      277764.46      306942.27
3     4.296111    16.824704       16805.11        9307.75
4     8.156023    35.011457       54411.42       58939.90

## Conclusion 

Before this lesson we used pandas for reading in datasets, producing summary statistics and slicing on the data. In this lesson you learned how to inspect which datatypes are contained, how to transform individual cells and columns using `.map()`, `.apply()` and `.applymap()`, and how to get insight about the contained values using `.value_counts()`.

## Additional resources


- [`pandas` Documentation](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf).
- [`pandas`: dtypes](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf)
- [`pandas` Series: value_counts](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.value_counts.html) 

For more advanced information on `.apply` usage, check out these links:

- ["Why Not"'s Gist Examples](https://gist.github.com/why-not/4582705)

- [Chris Albon's Map + Apply Examples](http://chrisalbon.com/python/pandas_apply_operations_to_dataframes.html)

In [ ]:
new_col_name={"Song Clean":"A","ARTIST CLEAN":"B","Release Year":"C",
              "COMBINED":"D","First?":"E","Year?":"F",
              "PlayCount":"G","F*G":"H"}